
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   14.1   Copyright 1985-2015 StataCorp LP
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
     MP - Parallel Edition            College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Single-user 4-core Stata perpetual license:
       Serial number:  501406275459
         Licensed to:  Miguel Urquiola
                       Columbia University

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.
      3.  More than 2 billion observations are allowed; see help obs_advice.
      4.  Maximum number of variables is set to 5000; see help set_maxvar.

. do create-training-data.do 

. #delimit;
delimiter now ;
. clear;

.  set matsize 5000;

.  set more off;

.  set type double;

. global tmp "/data/colomb/temp";

. global sp  "/data/spell/evan";

. foreach ds in icfes students2 {;
  2.  use $tmp/`ds', clear;
  3.  global l=upper(substr("`ds'",1,1));
  4.  keep    documento fullname;
  5.  bysort  documento fullname: keep if _n==1;
  6.  drop if documento<1000000 | documento==.;
  7.  drop if fullname=="";
  8.  by      documento: gen dup=_N;
  9.  tab dup;
 10.  keep if dup<=2;
 11.  drop dup;
 12.  by      documento: gen j=_n;
 13.  rename fullname ${l}name;
 14.  reshape wide ${l}name, i(documento) j(j);
 15.  save $sp/tomerge$l, replace;
 16. };
(1,002,252 observations deleted)
(133,638 observations deleted)
(2 observations deleted)

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  7,211,615       99.20       99.20
          2 |     56,128        0.77       99.97
          3 |      1,161        0.02       99.99
          4 |        488        0.01       99.99
          5 |        230        0.00       99.99
          6 |        108        0.00      100.00
          7 |         70        0.00      100.00
          8 |         40        0.00      100.00
          9 |         63        0.00      100.00
         10 |         30        0.00      100.00
         12 |         12        0.00      100.00
         13 |         26        0.00      100.00
         18 |         18        0.00      100.00
------------+-----------------------------------
      Total |  7,269,989      100.00
(2,246 observations deleted)
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                  7.3e+06   -> 7.2e+06
Number of variables                   3   ->       3
j variable (2 values)                 j   ->   (dropped)
xij variables:
                                  Iname   ->   Iname1 Iname2
-----------------------------------------------------------------------------
(note: file /data/spell/evan/tomergeI.dta not found)
file /data/spell/evan/tomergeI.dta saved
(650,665 observations deleted)
(60,642 observations deleted)
(63 observations deleted)

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  3,904,892       95.05       95.05
          2 |    195,450        4.76       99.81
          3 |      7,401        0.18       99.99
          4 |        388        0.01      100.00
          5 |         70        0.00      100.00
          6 |          6        0.00      100.00
          7 |          7        0.00      100.00
          8 |          8        0.00      100.00
         14 |         14        0.00      100.00
         73 |         73        0.00      100.00
------------+-----------------------------------
      Total |  4,108,309      100.00
(7,967 observations deleted)
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                  4.1e+06   -> 4.0e+06
Number of variables                   3   ->       3
j variable (2 values)                 j   ->   (dropped)
xij variables:
                                  Sname   ->   Sname1 Sname2
-----------------------------------------------------------------------------
(note: file /data/spell/evan/tomergeS.dta not found)
file /data/spell/evan/tomergeS.dta saved

. use $sp/tomergeI;

.  merge documento using $sp/tomergeS;
(note: you are using old merge syntax; see [D] merge for new syntax)

.  tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |  5,880,392       59.50       59.50
          2 |  2,643,330       26.75       86.25
          3 |  1,359,287       13.75      100.00
------------+-----------------------------------
      Total |  9,883,009      100.00

.  keep if _merge==3;
(8,523,722 observations deleted)

.  drop _merge;

. reshape long Iname, i(documento      ) j(j);
(note: j = 1 2)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                  1.4e+06   -> 2.7e+06
Number of variables                   5   ->       5
j variable (2 values)                     ->   j
xij variables:
                          Iname1 Iname2   ->   Iname
-----------------------------------------------------------------------------

.  drop if Iname=="";
(1,354,431 observations deleted)

.  drop j;

.  rename Iname name1;

. reshape long Sname, i(documento name1) j(j);
(note: j = 1 2)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                  1.4e+06   -> 2.7e+06
Number of variables                   4   ->       4
j variable (2 values)                     ->   j
xij variables:
                          Sname1 Sname2   ->   Sname
-----------------------------------------------------------------------------

.  drop if Sname=="";
(1,339,157 observations deleted)

.  drop j;

.  rename Sname name2;

. drop documento;

.  gen equal=name1==name2;

.  sort name1 name2;

. compress;
  variable equal was double now byte
  variable name2 was str104 now str67
  (61,121,676 bytes saved)

.  outsheet using $sp/names.csv, comma nonames noquote replace;

. foreach ds in tomergeI tomergeS {;
  2.  erase $sp/`ds'.dta;
  3. };

. 
end of do-file
